emacs/modes/company-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-10 二 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>company-mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">company-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org64cd217">1. 概述</a></li>
<li><a href="#orgbb28a80">2. 安装</a></li>
<li><a href="#org3a01332">3. 配置</a>
<ul>
<li><a href="#org9ab5cbe">3.1. company-idle-delay</a></li>
<li><a href="#org6db3f87">3.2. company-minimum-prefix-length</a></li>
<li><a href="#org1767de0">3.3. company-backends</a>
<ul>
<li><a href="#orge407939">3.3.1. 组合后端</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb9cebeb">4. 使用</a>
<ul>
<li><a href="#org76dbea0">4.1. company-complete-common</a></li>
<li><a href="#org1ac9131">4.2. company-complete-selection</a></li>
<li><a href="#org2e49ff7">4.3. company-complete</a></li>
<li><a href="#orgd637ff1">4.4. company-select-next</a></li>
<li><a href="#org56a4735">4.5. company-select-previous 选择列表中的前一项。</a></li>
<li><a href="#org2055bf4">4.6. 判断来源</a></li>
</ul>
</li>
<li><a href="#orgbe25469">5. 第三方插件</a>
<ul>
<li><a href="#org6fcf1af">5.1. company-capf</a></li>
<li><a href="#org1e9b5d8">5.2. company-dabbrev</a></li>
<li><a href="#orgf262907">5.3. company-dabbrev-code</a></li>
<li><a href="#orgc5da2c9">5.4. company-eclim</a></li>
<li><a href="#org70ce198">5.5. company-files</a></li>
<li><a href="#org1ed07a9">5.6. company-ispell</a></li>
<li><a href="#orga72d429">5.7. company-keywords</a></li>
<li><a href="#org10ddf8b">5.8. company-yasnippet</a></li>
<li><a href="#org6d181ea">5.9. company-lsp</a></li>
</ul>
</li>
<li><a href="#org737caa6">6. 后端</a></li>
<li><a href="#org60b7231">7. 编写后端</a></li>
</ul>
</div>
</div>

<div id="outline-container-org64cd217" class="outline-2">
<h2 id="org64cd217"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://company-mode.github.io/">company-mode</a> 是 Emacs 的一个文本补全框架。这个名字代表“complete anything”。它使用插件化的后端和前端检索和显示补全选项。
</p>

<p>
它自带了几个后端，如 <code>Elisp, Clang, Semantic, Eclim, Ropemacs, Ispell, CMake, BBDB, Yasnippet, dabbrev, etags, gtags, files, keywords</code> 等其他几个。
</p>

<p>
<code>CAPF</code> 后端作为与标准 completion-at-point-functions 功能之间的桥梁，能够与任何定义了正确补全函数的主模式一起工作。
</p>
</div>
</div>

<div id="outline-container-orgbb28a80" class="outline-2">
<h2 id="orgbb28a80"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<p>
该软件包是 GNU ELPA 的一部分，可以使用 <code>M-x list-packages</code> 进行安装。
</p>
</div>
</div>

<div id="outline-container-org3a01332" class="outline-2">
<h2 id="org3a01332"><span class="section-number-2">3</span> 配置</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9ab5cbe" class="outline-3">
<h3 id="org9ab5cbe"><span class="section-number-3">3.1</span> company-idle-delay</h3>
<div class="outline-text-3" id="text-3-1">
<p>
开始自动补全前的延迟秒数。输入前缀长度必须要满足 company-minimum-prefix-length，该值为 nil 表示没有延迟。
</p>
</div>
</div>

<div id="outline-container-org6db3f87" class="outline-3">
<h3 id="org6db3f87"><span class="section-number-3">3.2</span> company-minimum-prefix-length</h3>
<div class="outline-text-3" id="text-3-2">
<p>
补全的最小前缀长度。
</p>
</div>
</div>

<div id="outline-container-org1767de0" class="outline-3">
<h3 id="org1767de0"><span class="section-number-3">3.3</span> company-backends</h3>
<div class="outline-text-3" id="text-3-3">
<p>
company-backends 是激活的后端（backends）（补全引擎）的列表。
</p>

<p>
company 从 <code>company-backends</code> 获得补全数据，并使用 <code>company-frontends</code> 展示候选项。 如果想启动指定后端, 直接调用其即可，或使用 <code>company-begin-backend</code>.
</p>

<p>
那么后端间（backends）如何协同工作呢？
</p>

<p>
每次补全只能使用一个后端，这取决于后端在列表中的顺序，以及它们响应“prefix”命令的返回值：
</p>
<ul class="org-ul">
<li>non-nil，停止尝试下个后端，调用 candidates 命令获取候选项列表。</li>
<li>nil，说明该后端不能补全该 prefix，尝试下一个后端。</li>
</ul>
</div>

<div id="outline-container-orge407939" class="outline-4">
<h4 id="orge407939"><span class="section-number-4">3.3.1</span> 组合后端</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
但选中的后端也可以是一个“组合后端”，从这些后端中返回的候选项将被合并。
</p>

<p>
组合还可以包含关键字。当前定义了 <code>:with</code> 和 <code>:separate</code> 关键字。
</p>

<p>
如果组合包含关键字 <code>:with</code> ，出于 prefix 命令的目的（判断后端是否可以补全 prefix），将忽略该关键字后面的后端。
</p>

<p>
如果组合包含关键字 <code>:separate</code> ，来自不同后端的候选项将在组合列表中单独排序。
</p>

<p>
如果将候选项作为参数的后端命令（例如 meta），该命令将分派到候选项来自的后端。其他情况下（除‘duplicates’ and ‘sorted’外），返回所有后端中第一个 non-nil 值。
</p>

<p>
默认情况下，补全列表按字母排序，除非后端另有选择，或 <code>company-transformers</code> 做了修改.
</p>

<ul class="org-ul">
<li>company-transformers 用于更改从后端获取的候选项列表的函数集合。每个函数使用前一个函数的返回值作为参数，传递给第一个函数的是一个已经排序的无重复的候选项列表。</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb9cebeb" class="outline-2">
<h2 id="orgb9cebeb"><span class="section-number-2">4</span> 使用</h2>
<div class="outline-text-2" id="text-4">
<p>
安装之后，使用 <code>M-x company-mode</code> 启用 company-mode。
</p>

<p>
输入几个字母后就会自动进行补全。使用 M-n 和 M-p 选中候选项， <code>&lt;return&gt;</code> 补全， <code>&lt;tab&gt;</code> 补全公共部分。使用 <code>C-s, C-r and C-o</code> 搜索补全项。输入 <code>M-数字</code> 快速选中前 10 个中的候选项进行补全。
</p>

<p>
<code>M-x company-complete</code> 手动开始补全。
</p>

<p>
出现补全候选项后，按下 <code>&lt;f1&gt;</code> 显示选中后选项的文档，或者 <code>C-w</code> 查看它的源码。注意：不是所有的补全后端支持该功能。
</p>

<p>
下面的代码添加到 init 文件中就可以在所有的 buffer 中使用 company-mode：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'global-company-mode)
</pre>
</div>

<p>
要查看或更改已启用的后端列表，请键入 <code>M-x customize-variable RET company-backends</code> 。
</p>
</div>

<div id="outline-container-org76dbea0" class="outline-3">
<h3 id="org76dbea0"><span class="section-number-3">4.1</span> company-complete-common</h3>
<div class="outline-text-3" id="text-4-1">
<p>
自动插入所有候选项的公共部分。
</p>
</div>
</div>

<div id="outline-container-org1ac9131" class="outline-3">
<h3 id="org1ac9131"><span class="section-number-3">4.2</span> company-complete-selection</h3>
<div class="outline-text-3" id="text-4-2">
<p>
插入选中的后选项。
</p>
</div>
</div>

<div id="outline-container-org2e49ff7" class="outline-3">
<h3 id="org2e49ff7"><span class="section-number-3">4.3</span> company-complete</h3>
<div class="outline-text-3" id="text-4-3">
<p>
插入所有候选项的公共部分或当前选中项。首次被调用时，插入公共部分，第二次或改变选中项后，插入选中项。
</p>
</div>
</div>
<div id="outline-container-orgd637ff1" class="outline-3">
<h3 id="orgd637ff1"><span class="section-number-3">4.4</span> company-select-next</h3>
<div class="outline-text-3" id="text-4-4">
<p>
选择列表中的下一项。
</p>
</div>
</div>

<div id="outline-container-org56a4735" class="outline-3">
<h3 id="org56a4735"><span class="section-number-3">4.5</span> company-select-previous 选择列表中的前一项。</h3>
<div class="outline-text-3" id="text-4-5">
<p>
如果这些命令在 company-idle-delay 前调用，也会开始补全。
</p>

<p>
可以使用‘company-search-candidates’ or ‘company-filter-candidates’搜索候选项。未激活补全也可以使用。
</p>
</div>
</div>

<div id="outline-container-org2055bf4" class="outline-3">
<h3 id="org2055bf4"><span class="section-number-3">4.6</span> 判断来源</h3>
<div class="outline-text-3" id="text-4-6">
<p>
如何判断，当前候选项，来自哪个 company-backends？
</p>

<p>
<code>m-x diminish-undo</code> ，然后选择 company-mode 后，mode-line 会显示当前补全的候选项来自哪个 company-backends。
</p>
</div>
</div>
</div>

<div id="outline-container-orgbe25469" class="outline-2">
<h2 id="orgbe25469"><span class="section-number-2">5</span> 第三方插件</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org6fcf1af" class="outline-3">
<h3 id="org6fcf1af"><span class="section-number-3">5.1</span> company-capf</h3>
<div class="outline-text-3" id="text-5-1">
<p>
使用 completion-at-point-functions 的后端，但是在 cc-mode 中做补全时，发现会导致 buffer 中输入卡顿，暂时不使用该后端。
</p>
</div>
</div>

<div id="outline-container-org1e9b5d8" class="outline-3">
<h3 id="org1e9b5d8"><span class="section-number-3">5.2</span> company-dabbrev</h3>
<div class="outline-text-3" id="text-5-2">
<p>
   使用 dabbrev（Dynamic Abbreviation
）的后端，主要用来补全当前 buffer 中出现的 word。很有用。
</p>
</div>
</div>

<div id="outline-container-orgf262907" class="outline-3">
<h3 id="orgf262907"><span class="section-number-3">5.3</span> company-dabbrev-code</h3>
<div class="outline-text-3" id="text-5-3">
<p>
类似 company-dabbrev，但是不在注释或者字符串中查找符号。编程很有用。
</p>
</div>
</div>

<div id="outline-container-orgc5da2c9" class="outline-3">
<h3 id="orgc5da2c9"><span class="section-number-3">5.4</span> company-eclim</h3>
<div class="outline-text-3" id="text-5-4">
<p>
eclipse 补全后端。
</p>
</div>
</div>

<div id="outline-container-org70ce198" class="outline-3">
<h3 id="org70ce198"><span class="section-number-3">5.5</span> company-files</h3>
<div class="outline-text-3" id="text-5-5">
<p>
补全文件系统的路径后端。
</p>
</div>
</div>

<div id="outline-container-org1ed07a9" class="outline-3">
<h3 id="org1ed07a9"><span class="section-number-3">5.6</span> company-ispell</h3>
<div class="outline-text-3" id="text-5-6">
<p>
ispell 使用的后端。
</p>
</div>
</div>

<div id="outline-container-orga72d429" class="outline-3">
<h3 id="orga72d429"><span class="section-number-3">5.7</span> company-keywords</h3>
<div class="outline-text-3" id="text-5-7">
<p>
使用当前文件所属编程语言的语法关键词补全。
</p>
</div>
</div>

<div id="outline-container-org10ddf8b" class="outline-3">
<h3 id="org10ddf8b"><span class="section-number-3">5.8</span> company-yasnippet</h3>
<div class="outline-text-3" id="text-5-8">
<p>
使用 yasnippet 补全的后端。
</p>
</div>
</div>

<div id="outline-container-org6d181ea" class="outline-3">
<h3 id="org6d181ea"><span class="section-number-3">5.9</span> company-lsp</h3>
<div class="outline-text-3" id="text-5-9">
<p>
lsp-mode 配合使用补全后端。
</p>
</div>
</div>
</div>

<div id="outline-container-org737caa6" class="outline-2">
<h2 id="org737caa6"><span class="section-number-2">6</span> 后端</h2>
<div class="outline-text-2" id="text-6">
<p>
后端（backend）是一个接受可变数量参数的函数，第一个参数是请求后端的命令。它是以下之一：
</p>

<ul class="org-ul">
<li><p>
prefix
</p>

<p>
后端应该返回待补全的文本。它必须是紧接在 point 之前的文字。从该命令返回 nil 会将控制权交给下个后端。如果应该补全但不能补全，例如当在符号中间，该函数应该返回“stop”。
</p>

<p>
后端可能返回一个 (PREFIX . LENGTH)， 而不是 string。当与 company-minimum-prefix-length 比较时，LENGTH 替代 PREFIX 长度。LENGTH 也可能是 t，这种情况下，比较测试自动成功。
</p></li>

<li><p>
candidates
</p>

<p>
第二个参数是待补全的前缀（prefix）。返回值应该是匹配前缀的候选项列表。
</p>

<p>
还支持非前缀匹配（候选项不以前缀开始，但通过后端定义的方式匹配）。使用这种功能的后缀必须禁用 cache（对'no-cache'返回 t），并且可能还想响应'match'。
</p></li>
</ul>

<p>
其他可选命令：
</p>

<ul class="org-ul">
<li><p>
sorted
</p>

<p>
返回 t 表示后选项已排序，不需要重新排序。
</p></li>

<li><p>
duplicates
</p>

<p>
如 non-nil，company 负责从列表中删除重复项。
</p></li>

<li><p>
no-cache
</p>

<p>
通常补全过程中，company 不会再次查询候选项，除非该命令后端返回 t。第二个参数是最新的前缀。
</p></li>

<li><p>
ignore-case
</p>

<p>
如果后端返回不缺分大小写的后选项，该命令返回 t。该值用于确定最长公共前缀（如 company-complete-common 所用），和过滤从 cache 中获取的候选项。
</p></li>

<li><p>
meta
</p>

<p>
第二个参数是补全候选项。返回其（简短）文档字符串。
</p></li>

<li><p>
doc-buffer
</p>

<p>
第二个参数是补全候选项。返回候选项文档的 buffer，最好使用 company-doc-buffer。如果不是所有的 buffer 内容都属于该候选项，返回 buffer 和窗口开始位置组成的的 cons。
</p></li>

<li><p>
location
</p>

<p>
第二个参数是补全候选项。返回 buffer 和 buffer 位置，或文件和行号组成的 cons，这些是候选项定义的位置。
</p></li>

<li><p>
annotation
</p>

<p>
第二个参数是补全候选项。返回与候选项在弹出窗口（popup）一起显示的字符串。如果是 company 负责删除重复项，带有不同 annotation 的相同候选项会保留。为了此项正常工作，后端应该使用文本属性保存候选项的相关信息。
</p></li>

<li>match
第二个参数是补全候选项。返回候选项字符串中匹配前缀（不一定是以前缀开始）位置的索引。该命令在渲染弹出窗口的时候有用。该命令只对提供非前缀匹配的后端有用。</li>

<li><p>
require-match
</p>

<p>
如果返回 t，用户不得输入任何不是候选项的内容。不要在正常的后端中使用该值。默认值 nil 给用户提供 company-require-match 所带的选择。返回值‘never’会以相反的方式覆盖该选项。
</p></li>

<li><p>
init
</p>

<p>
每个 buffer 调用一次。后端可以检查外部程序和文件，并加载任何所需的库。此处发生错误将在消息日志中显示一次，该后端将不会用于补全。
</p></li>

<li><p>
post-completion
</p>

<p>
候选项插入 buffer 之后调用。第二个参数是补全候选项。可以用来修改候选项，例如，扩展 snippet。
</p></li>
</ul>

<p>
后端对于所有不支持或不知道的命令应该返回 nil。它应该可以交互调用，或使用 company-begin-backend 启动自身。
</p>
</div>
</div>

<div id="outline-container-org60b7231" class="outline-2">
<h2 id="org60b7231"><span class="section-number-2">7</span> 编写后端</h2>
<div class="outline-text-2" id="text-7">
<p>
当输入 <code>foo</code> 的时候，下面这个后端将会提示： <code>foobar foobaz foobarbaz</code> 。
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">company-my-backend</span> (command <span style="color: #00d7af;">&amp;optional</span> arg <span style="color: #00d7af;">&amp;rest</span> ignored)
    (<span style="color: #a1db00;">interactive</span> (list 'interactive))
    (<span style="color: #a1db00;">case</span> command
      (<span style="color: #a1db00;">interactive</span> (company-begin-backend 'company-my-backend))
      (prefix (<span style="color: #a1db00;">when</span> (looking-back <span style="color: #ff4ea3;">"foo\\&gt;"</span>)
                (match-string 0)))
      (candidates (<span style="color: #a1db00;">when</span> (equal arg <span style="color: #ff4ea3;">"foo"</span>)
                    (list <span style="color: #ff4ea3;">"foobar"</span> <span style="color: #ff4ea3;">"foobaz"</span> <span style="color: #ff4ea3;">"foobarbaz"</span>)))
      (meta (format <span style="color: #ff4ea3;">"This value is named %s"</span> arg))))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-09-10 二 19:59</p>
<p class="validation"></p>
</div>
</body>
</html>
